podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL25Z4.h
// Pin Mapping for LLWU_P10 signal
//   <o> LLWU_P10 [PTC6]<name=LLWU_P10_PIN_SEL>
//   <i> Shows which pin LLWU_P10 is mapped to
//     <0=> Disabled
//     <1=> PTC6 (Alias:D21)<selection=PTC6_SIG_SEL,GPIOC_6/LLWU_P10>
//     <0=> Default
#define LLWU_P10_PIN_SEL     0
#if LLWU_P10_PIN_SEL == 1
#define LLWU_P10_GPIO        USBDM::GpioC<6>
#define LLWU_P10_FN          1
#endif

// Pin Mapping for LLWU_P14 signal
//   <o> LLWU_P14 [PTD4]<name=LLWU_P14_PIN_SEL>
//   <i> Shows which pin LLWU_P14 is mapped to
//     <0=> Disabled
//     <1=> PTD4 (Alias:D2)<selection=PTD4_SIG_SEL,GPIOD_4/LLWU_P14>
//     <0=> Default
#define LLWU_P14_PIN_SEL     0
#if LLWU_P14_PIN_SEL == 1
#define LLWU_P14_GPIO        USBDM::GpioD<4>
#define LLWU_P14_FN          1
#endif

// Pin Mapping for LLWU_P15 signal
//   <o> LLWU_P15 [PTD6]<name=LLWU_P15_PIN_SEL>
//   <i> Shows which pin LLWU_P15 is mapped to
//     <0=> Disabled
//     <1=> PTD6 (Alias:D32)<selection=PTD6_SIG_SEL,GPIOD_6/LLWU_P15>
//     <0=> Default
#define LLWU_P15_PIN_SEL     0
#if LLWU_P15_PIN_SEL == 1
#define LLWU_P15_GPIO        USBDM::GpioD<6>
#define LLWU_P15_FN          1
#endif

// </h>

// <h> Low Power Timer (LPTMR)

// Pin Mapping for LPTMR0_ALT1 signal
//   <o> LPTMR0_ALT1 [PTA19]<name=LPTMR0_ALT1_PIN_SEL>
//   <i> Shows which pin LPTMR0_ALT1 is mapped to
//     <0=> Disabled
//     <1=> PTA19<selection=PTA19_SIG_SEL,LPTMR0_ALT1>
//     <0=> Default
#define LPTMR0_ALT1_PIN_SEL  0
#if LPTMR0_ALT1_PIN_SEL == 1
#define LPTMR0_ALT1_GPIO     USBDM::GpioA<19>
#define LPTMR0_ALT1_FN       6
#endif

// Pin Mapping for LPTMR0_ALT2 signal
//   <o> LPTMR0_ALT2 [PTC5]<name=LPTMR0_ALT2_PIN_SEL>
//   <i> Shows which pin LPTMR0_ALT2 is mapped to
//     <0=> Disabled
//     <1=> PTC5 (Alias:D20)<selection=PTC5_SIG_SEL,LPTMR0_ALT2>
//     <0=> Default
#define LPTMR0_ALT2_PIN_SEL  0
#if LPTMR0_ALT2_PIN_SEL == 1
#define LPTMR0_ALT2_GPIO     USBDM::GpioC<5>
#define LPTMR0_ALT2_FN       3
#endif

// </h>

// <h> Debug and Control

// Pin Mapping for NMI_b signal
//   <o> NMI_b [PTA4]<name=NMI_b_PIN_SEL>
//   <i> Shows which pin NMI_b is mapped to
//     <0=> Disabled
//     <1=> PTA4 (Alias:D4)<selection=PTA4_SIG_SEL,NMI_b>
//     <0=> Default
#define NMI_b_PIN_SEL        0
#if NMI_b_PIN_SEL == 1
#define NMI_b_GPIO           USBDM::GpioA<4>
#define NMI_b_FN             7
#endif

// Pin Mapping for SWD_CLK signal
//   <o> SWD_CLK [PTA0]<name=SWD_CLK_PIN_SEL>
//   <i> Shows which pin SWD_CLK is mapped to
//     <0=> Disabled
//     <1=> PTA0<selection=PTA0_SIG_SEL,SWD_CLK>
//     <0=> Default
#define SWD_CLK_PIN_SEL      0
#if SWD_CLK_PIN_SEL == 1
#define SWD_CLK_GPIO         USBDM::GpioA<0>
#define SWD_CLK_FN           7
#endif

// Pin Mapping for SWD_DIO signal
//   <o> SWD_DIO [PTA3]<name=SWD_DIO_PIN_SEL>
//   <i> Shows which pin SWD_DIO is mapped to
//     <0=> Disabled
//     <1=> PTA3<selection=PTA3_SIG_SEL,SWD_DIO>
//     <0=> Default
#define SWD_DIO_PIN_SEL      0
#if SWD_DIO_PIN_SEL == 1
#define SWD_DIO_GPIO         USBDM::GpioA<3>
#define SWD_DIO_FN           7
#endif

// </h>

// <h> Serial Peripheral Interface (SPI0)

// Pin Mapping for SPI0_MISO signal
//   <o> SPI0_MISO [PTA17, PTC7, PTD3, PTA16, PTC6, PTD2]<name=SPI0_MISO_PIN_SEL>
//   <i> Shows which pin SPI0_MISO is mapped to
//     <0=> Disabled
//     <1=> PTA17 (Alias:D29)<selection=PTA17_SIG_SEL,SPI0_MISO>
//     <2=> PTC7 (Alias:D16)<selection=PTC7_SIG_SEL,SPI0_MISO>
//     <3=> PTD3 (Alias:D12)<selection=PTD3_SIG_SEL,SPI0_MISO>
//     <4=> PTA16 (Alias:D28)<selection=PTA16_SIG_SEL,SPI0_MISO>
//     <5=> PTC6 (Alias:D21)<selection=PTC6_SIG_SEL,SPI0_MISO>
//     <6=> PTD2 (Alias:D11)<selection=PTD2_SIG_SEL,SPI0_MISO>
//     <0=> Default
#define SPI0_MISO_PIN_SEL    0
#if SPI0_MISO_PIN_SEL == 1
#define SPI0_MISO_GPIO       USBDM::GpioA<17>
#define SPI0_MISO_FN         2
#elif SPI0_MISO_PIN_SEL == 2
#define SPI0_MISO_GPIO       USBDM::GpioC<7>
#define SPI0_MISO_FN         2
#elif SPI0_MISO_PIN_SEL == 3
#define SPI0_MISO_GPIO       USBDM::GpioD<3>
#define SPI0_MISO_FN         2
#elif SPI0_MISO_PIN_SEL == 4
#define SPI0_MISO_GPIO       USBDM::GpioA<16>
#define SPI0_MISO_FN         5
#elif SPI0_MISO_PIN_SEL == 5
#define SPI0_MISO_GPIO       USBDM::GpioC<6>
#define SPI0_MISO_FN         5
#elif SPI0_MISO_PIN_SEL == 6
#define SPI0_MISO_GPIO       USBDM::GpioD<2>
#define SPI0_MISO_FN         5
#endif

// Pin Mapping for SPI0_MOSI signal
//   <o> SPI0_MOSI [PTA16, PTC6, PTD2, PTA17, PTC7, PTD3]<name=SPI0_MOSI_PIN_SEL>
//   <i> Shows which pin SPI0_MOSI is mapped to
//     <0=> Disabled
//     <1=> PTA16 (Alias:D28)<selection=PTA16_SIG_SEL,SPI0_MOSI>
//     <2=> PTC6 (Alias:D21)<selection=PTC6_SIG_SEL,SPI0_MOSI>
//     <3=> PTD2 (Alias:D11)<selection=PTD2_SIG_SEL,SPI0_MOSI>
//     <4=> PTA17 (Alias:D29)<selection=PTA17_SIG_SEL,SPI0_MOSI>
//     <5=> PTC7 (Alias:D16)<selection=PTC7_SIG_SEL,SPI0_MOSI>
//     <6=> PTD3 (Alias:D12)<selection=PTD3_SIG_SEL,SPI0_MOSI>
//     <0=> Default
#define SPI0_MOSI_PIN_SEL    0
#if SPI0_MOSI_PIN_SEL == 1
#define SPI0_MOSI_GPIO       USBDM::GpioA<16>
#define SPI0_MOSI_FN         2
#elif SPI0_MOSI_PIN_SEL == 2
#define SPI0_MOSI_GPIO       USBDM::GpioC<6>
#define SPI0_MOSI_FN         2
#elif SPI0_MOSI_PIN_SEL == 3
#define SPI0_MOSI_GPIO       USBDM::GpioD<2>
#define SPI0_MOSI_FN         2
#elif SPI0_MOSI_PIN_SEL == 4
#define SPI0_MOSI_GPIO       USBDM::GpioA<17>
#define SPI0_MOSI_FN         5
#elif SPI0_MOSI_PIN_SEL == 5
#define SPI0_MOSI_GPIO       USBDM::GpioC<7>
#define SPI0_MOSI_FN         5
#elif SPI0_MOSI_PIN_SEL == 6
#define SPI0_MOSI_GPIO       USBDM::GpioD<3>
#define SPI0_MOSI_FN         5
#endif

// Pin Mapping for SPI0_PCS0 signal
//   <o> SPI0_PCS0 [PTA14, PTC4, PTD0]<name=SPI0_PCS0_PIN_SEL>
//   <i> Shows which pin SPI0_PCS0 is mapped to
//     <0=> Disabled
//     <1=> PTA14<selection=PTA14_SIG_SEL,SPI0_PCS0>
//     <2=> PTC4 (Alias:D19)<selection=PTC4_SIG_SEL,SPI0_PCS0>
//     <3=> PTD0 (Alias:D10)<selection=PTD0_SIG_SEL,SPI0_PCS0>
//     <0=> Default
#define SPI0_PCS0_PIN_SEL    0
#if SPI0_PCS0_PIN_SEL == 1
#define SPI0_PCS0_GPIO       USBDM::GpioA<14>
#define SPI0_PCS0_FN         2
#elif SPI0_PCS0_PIN_SEL == 2
#define SPI0_PCS0_GPIO       USBDM::GpioC<4>
#define SPI0_PCS0_FN         2
#elif SPI0_PCS0_PIN_SEL == 3
#define SPI0_PCS0_GPIO       USBDM::GpioD<0>
#define SPI0_PCS0_FN         2
#endif

// Pin Mapping for SPI0_SCK signal
//   <o> SPI0_SCK [PTA15, PTC5, PTD1]<name=SPI0_SCK_PIN_SEL>
//   <i> Shows which pin SPI0_SCK is mapped to
//     <0=> Disabled
//     <1=> PTA15<selection=PTA15_SIG_SEL,SPI0_SCK>
//     <2=> PTC5 (Alias:D20)<selection=PTC5_SIG_SEL,SPI0_SCK>
//     <3=> PTD1 (Alias:D13, LED_BLUE)<selection=PTD1_SIG_SEL,SPI0_SCK>
//     <0=> Default
#define SPI0_SCK_PIN_SEL     0
#if SPI0_SCK_PIN_SEL == 1
#define SPI0_SCK_GPIO        USBDM::GpioA<15>
#define SPI0_SCK_FN          2
#elif SPI0_SCK_PIN_SEL == 2
#define SPI0_SCK_GPIO        USBDM::GpioC<5>
#define SPI0_SCK_FN          2
#elif SPI0_SCK_PIN_SEL == 3
#define SPI0_SCK_GPIO        USBDM::GpioD<1>
#define SPI0_SCK_FN          2
#endif

