podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL25Z4.h
// </h>

// <h> Serial Peripheral Interface (SPI1)

// Pin Mapping for SPI1_MISO signal
//   <o> SPI1_MISO [PTB17, PTD7, PTE3, PTB16, PTD6, PTE1]<name=SPI1_MISO_PIN_SEL>
//   <i> Shows which pin SPI1_MISO is mapped to
//     <0=> Disabled
//     <1=> PTB17<selection=PTB17_SIG_SEL,SPI1_MISO>
//     <2=> PTD7 (Alias:D33)<selection=PTD7_SIG_SEL,SPI1_MISO>
//     <3=> PTE3 (Alias:A15)<selection=PTE3_SIG_SEL,SPI1_MISO>
//     <4=> PTB16<selection=PTB16_SIG_SEL,SPI1_MISO>
//     <5=> PTD6 (Alias:D32)<selection=PTD6_SIG_SEL,SPI1_MISO>
//     <6=> PTE1 (Alias:D14)<selection=PTE1_SIG_SEL,SPI1_MISO>
//     <0=> Default
#define SPI1_MISO_PIN_SEL    0
#if SPI1_MISO_PIN_SEL == 1
#define SPI1_MISO_GPIO       USBDM::GpioB<17>
#define SPI1_MISO_FN         2
#elif SPI1_MISO_PIN_SEL == 2
#define SPI1_MISO_GPIO       USBDM::GpioD<7>
#define SPI1_MISO_FN         2
#elif SPI1_MISO_PIN_SEL == 3
#define SPI1_MISO_GPIO       USBDM::GpioE<3>
#define SPI1_MISO_FN         2
#elif SPI1_MISO_PIN_SEL == 4
#define SPI1_MISO_GPIO       USBDM::GpioB<16>
#define SPI1_MISO_FN         5
#elif SPI1_MISO_PIN_SEL == 5
#define SPI1_MISO_GPIO       USBDM::GpioD<6>
#define SPI1_MISO_FN         5
#elif SPI1_MISO_PIN_SEL == 6
#define SPI1_MISO_GPIO       USBDM::GpioE<1>
#define SPI1_MISO_FN         5
#endif

// Pin Mapping for SPI1_MOSI signal
//   <o> SPI1_MOSI [PTB16, PTD6, PTE1, PTB17, PTD7, PTE3]<name=SPI1_MOSI_PIN_SEL>
//   <i> Shows which pin SPI1_MOSI is mapped to
//     <0=> Disabled
//     <1=> PTB16<selection=PTB16_SIG_SEL,SPI1_MOSI>
//     <2=> PTD6 (Alias:D32)<selection=PTD6_SIG_SEL,SPI1_MOSI>
//     <3=> PTE1 (Alias:D14)<selection=PTE1_SIG_SEL,SPI1_MOSI>
//     <4=> PTB17<selection=PTB17_SIG_SEL,SPI1_MOSI>
//     <5=> PTD7 (Alias:D33)<selection=PTD7_SIG_SEL,SPI1_MOSI>
//     <6=> PTE3 (Alias:A15)<selection=PTE3_SIG_SEL,SPI1_MOSI>
//     <0=> Default
#define SPI1_MOSI_PIN_SEL    0
#if SPI1_MOSI_PIN_SEL == 1
#define SPI1_MOSI_GPIO       USBDM::GpioB<16>
#define SPI1_MOSI_FN         2
#elif SPI1_MOSI_PIN_SEL == 2
#define SPI1_MOSI_GPIO       USBDM::GpioD<6>
#define SPI1_MOSI_FN         2
#elif SPI1_MOSI_PIN_SEL == 3
#define SPI1_MOSI_GPIO       USBDM::GpioE<1>
#define SPI1_MOSI_FN         2
#elif SPI1_MOSI_PIN_SEL == 4
#define SPI1_MOSI_GPIO       USBDM::GpioB<17>
#define SPI1_MOSI_FN         5
#elif SPI1_MOSI_PIN_SEL == 5
#define SPI1_MOSI_GPIO       USBDM::GpioD<7>
#define SPI1_MOSI_FN         5
#elif SPI1_MOSI_PIN_SEL == 6
#define SPI1_MOSI_GPIO       USBDM::GpioE<3>
#define SPI1_MOSI_FN         5
#endif

// Pin Mapping for SPI1_PCS0 signal
//   <o> SPI1_PCS0 [PTB10, PTD4, PTE4]<name=SPI1_PCS0_PIN_SEL>
//   <i> Shows which pin SPI1_PCS0 is mapped to
//     <0=> Disabled
//     <1=> PTB10 (Alias:A18)<selection=PTB10_SIG_SEL,SPI1_PCS0>
//     <2=> PTD4 (Alias:D2)<selection=PTD4_SIG_SEL,SPI1_PCS0>
//     <3=> PTE4 (Alias:A14)<selection=PTE4_SIG_SEL,SPI1_PCS0>
//     <0=> Default
#define SPI1_PCS0_PIN_SEL    0
#if SPI1_PCS0_PIN_SEL == 1
#define SPI1_PCS0_GPIO       USBDM::GpioB<10>
#define SPI1_PCS0_FN         2
#elif SPI1_PCS0_PIN_SEL == 2
#define SPI1_PCS0_GPIO       USBDM::GpioD<4>
#define SPI1_PCS0_FN         2
#elif SPI1_PCS0_PIN_SEL == 3
#define SPI1_PCS0_GPIO       USBDM::GpioE<4>
#define SPI1_PCS0_FN         2
#endif

// Pin Mapping for SPI1_SCK signal
//   <o> SPI1_SCK [PTB11, PTD5, PTE2]<name=SPI1_SCK_PIN_SEL>
//   <i> Shows which pin SPI1_SCK is mapped to
//     <0=> Disabled
//     <1=> PTB11 (Alias:A17)<selection=PTB11_SIG_SEL,SPI1_SCK>
//     <2=> PTD5 (Alias:D9)<selection=PTD5_SIG_SEL,SPI1_SCK>
//     <3=> PTE2 (Alias:A16)<selection=PTE2_SIG_SEL,SPI1_SCK>
//     <0=> Default
#define SPI1_SCK_PIN_SEL     0
#if SPI1_SCK_PIN_SEL == 1
#define SPI1_SCK_GPIO        USBDM::GpioB<11>
#define SPI1_SCK_FN          2
#elif SPI1_SCK_PIN_SEL == 2
#define SPI1_SCK_GPIO        USBDM::GpioD<5>
#define SPI1_SCK_FN          2
#elif SPI1_SCK_PIN_SEL == 3
#define SPI1_SCK_GPIO        USBDM::GpioE<2>
#define SPI1_SCK_FN          2
#endif

// </h>

// <h> Timer (TPM0)

// Pin Mapping for TPM0_CH0 signal
//   <o> TPM0_CH0 [PTA3, PTE24, PTC1, PTD0]<name=TPM0_CH0_PIN_SEL>
//   <i> Shows which pin TPM0_CH0 is mapped to
//     <0=> Disabled
//     <1=> PTA3<selection=PTA3_SIG_SEL,TPM0_CH0>
//     <2=> PTE24 (Alias:ACCEL_SCL)<selection=PTE24_SIG_SEL,TPM0_CH0>
//     <3=> PTC1 (Alias:A5)<selection=PTC1_SIG_SEL,TPM0_CH0>
//     <4=> PTD0 (Alias:D10)<selection=PTD0_SIG_SEL,TPM0_CH0>
//     <0=> Default
#define TPM0_CH0_PIN_SEL     0
#if TPM0_CH0_PIN_SEL == 1
#define TPM0_CH0_GPIO        USBDM::GpioA<3>
#define TPM0_CH0_FN          3
#elif TPM0_CH0_PIN_SEL == 2
#define TPM0_CH0_GPIO        USBDM::GpioE<24>
#define TPM0_CH0_FN          3
#elif TPM0_CH0_PIN_SEL == 3
#define TPM0_CH0_GPIO        USBDM::GpioC<1>
#define TPM0_CH0_FN          4
#elif TPM0_CH0_PIN_SEL == 4
#define TPM0_CH0_GPIO        USBDM::GpioD<0>
#define TPM0_CH0_FN          4
#endif

// Pin Mapping for TPM0_CH1 signal
//   <o> TPM0_CH1 [PTA4, PTE25, PTC2, PTD1]<name=TPM0_CH1_PIN_SEL>
//   <i> Shows which pin TPM0_CH1 is mapped to
//     <0=> Disabled
//     <1=> PTA4 (Alias:D4)<selection=PTA4_SIG_SEL,TPM0_CH1>
//     <2=> PTE25 (Alias:ACCEL_SDA)<selection=PTE25_SIG_SEL,TPM0_CH1>
//     <3=> PTC2 (Alias:A4)<selection=PTC2_SIG_SEL,TPM0_CH1>
//     <4=> PTD1 (Alias:D13, LED_BLUE)<selection=PTD1_SIG_SEL,TPM0_CH1>
//     <4=> Default
#define TPM0_CH1_PIN_SEL     4
#if TPM0_CH1_PIN_SEL == 1
#define TPM0_CH1_GPIO        USBDM::GpioA<4>
#define TPM0_CH1_FN          3
#elif TPM0_CH1_PIN_SEL == 2
#define TPM0_CH1_GPIO        USBDM::GpioE<25>
#define TPM0_CH1_FN          3
#elif TPM0_CH1_PIN_SEL == 3
#define TPM0_CH1_GPIO        USBDM::GpioC<2>
#define TPM0_CH1_FN          4
#elif TPM0_CH1_PIN_SEL == 4
#define TPM0_CH1_GPIO        USBDM::GpioD<1>
#define TPM0_CH1_FN          4
#endif

// Pin Mapping for TPM0_CH2 signal
//   <o> TPM0_CH2 [PTA5, PTE29, PTC3, PTD2]<name=TPM0_CH2_PIN_SEL>
//   <i> Shows which pin TPM0_CH2 is mapped to
//     <0=> Disabled
//     <1=> PTA5 (Alias:D5)<selection=PTA5_SIG_SEL,TPM0_CH2>
//     <2=> PTE29 (Alias:A7)<selection=PTE29_SIG_SEL,TPM0_CH2>
//     <3=> PTC3 (Alias:D18)<selection=PTC3_SIG_SEL,TPM0_CH2>
//     <4=> PTD2 (Alias:D11)<selection=PTD2_SIG_SEL,TPM0_CH2>
//     <0=> Default
#define TPM0_CH2_PIN_SEL     0
#if TPM0_CH2_PIN_SEL == 1
#define TPM0_CH2_GPIO        USBDM::GpioA<5>
#define TPM0_CH2_FN          3
#elif TPM0_CH2_PIN_SEL == 2
#define TPM0_CH2_GPIO        USBDM::GpioE<29>
#define TPM0_CH2_FN          3
#elif TPM0_CH2_PIN_SEL == 3
#define TPM0_CH2_GPIO        USBDM::GpioC<3>
#define TPM0_CH2_FN          4
#elif TPM0_CH2_PIN_SEL == 4
#define TPM0_CH2_GPIO        USBDM::GpioD<2>
#define TPM0_CH2_FN          4
#endif

// Pin Mapping for TPM0_CH3 signal
//   <o> TPM0_CH3 [PTE30, PTC4, PTD3]<name=TPM0_CH3_PIN_SEL>
//   <i> Shows which pin TPM0_CH3 is mapped to
//     <0=> Disabled
//     <1=> PTE30 (Alias:A6)<selection=PTE30_SIG_SEL,TPM0_CH3>
//     <2=> PTC4 (Alias:D19)<selection=PTC4_SIG_SEL,TPM0_CH3>
//     <3=> PTD3 (Alias:D12)<selection=PTD3_SIG_SEL,TPM0_CH3>
//     <0=> Default
#define TPM0_CH3_PIN_SEL     0
#if TPM0_CH3_PIN_SEL == 1
#define TPM0_CH3_GPIO        USBDM::GpioE<30>
#define TPM0_CH3_FN          3
#elif TPM0_CH3_PIN_SEL == 2
#define TPM0_CH3_GPIO        USBDM::GpioC<4>
#define TPM0_CH3_FN          4
#elif TPM0_CH3_PIN_SEL == 3
#define TPM0_CH3_GPIO        USBDM::GpioD<3>
#define TPM0_CH3_FN          4
#endif

// Pin Mapping for TPM0_CH4 signal
//   <o> TPM0_CH4 [PTC8, PTE31, PTD4]<name=TPM0_CH4_PIN_SEL>
//   <i> Shows which pin TPM0_CH4 is mapped to
//     <0=> Disabled
//     <1=> PTC8 (Alias:D6)<selection=PTC8_SIG_SEL,TPM0_CH4>
//     <2=> PTE31 (Alias:D30)<selection=PTE31_SIG_SEL,TPM0_CH4>
//     <3=> PTD4 (Alias:D2)<selection=PTD4_SIG_SEL,TPM0_CH4>
//     <0=> Default
#define TPM0_CH4_PIN_SEL     0
#if TPM0_CH4_PIN_SEL == 1
#define TPM0_CH4_GPIO        USBDM::GpioC<8>
#define TPM0_CH4_FN          3
#elif TPM0_CH4_PIN_SEL == 2
#define TPM0_CH4_GPIO        USBDM::GpioE<31>
#define TPM0_CH4_FN          3
#elif TPM0_CH4_PIN_SEL == 3
#define TPM0_CH4_GPIO        USBDM::GpioD<4>
#define TPM0_CH4_FN          4
#endif

